# -*- coding:utf-8 -*-
# python_version:2.7.13

''' 题目：一个整数，它加上100后是一个完全平方数，再加上168又是一个完全平方数，请问该数是多少？
程序分析： 假设该数为 x。
1、则：x + 100 = n2, x + 100 + 168 = m2
2、计算等式：m2 - n2 = (m + n)(m - n) = 168
3、设置： m + n = i，m - n = j，i * j =168，i 和 j 至少一个是偶数
4、可得： m = (i + j) / 2， n = (i - j) / 2，i 和 j 要么都是偶数，要么都是奇数。
5、从 3 和 4 推导可知道，i 与 j 均是大于等于 2 的偶数。
6、由于 i * j = 168， j>=2，则 1 < i < 168 / 2 + 1。
7、接下来将 i 的所有数字循环计算即可。'''

# 第一种方法 中规中矩
for i in range(1, 85):
    if 168 % i == 0:
        j = 168 / i;
        if i > j and (i + j) % 2 == 0 and (i - j) % 2 == 0:
            m = (i + j) / 2
            n = (i - j) / 2
            x = n * n - 100
            print(x)

# 第二种方法 新解法（来自CosmosHua（cosmoscosmos@163.com））
# 设该数为x：x + 100 = n^2, n^2 + 168 = m^2。
# 设m=n+k（不妨设m,n,k均为自然数）：带入m^2-n^2-168，得k^2+2nk=168。
# 解得n=84/k - k/2；由于n,k均为自然数，则nk>=1，故1< =k^2<168，故1<=k<=12。
for x in range(1, 13):
    a = 84 / x - x / 2
    if int(a) == a:
        n = a ** 2 - 100
        print(n)

# 第四种方法
for i in range(1, 85):
    if 168 % i == 0:
        j = 168 / i
        if i > j:
            m = (i + j) / 2
            n = (i - j) / 2
            if m * m - 268 == n * n - 100 and (n * n - 100) % 1 == 0:
                print('x = ', m * m - 268)

# 第五种方法
for m in range(168):
    for n in range(m):
        if (m + n) * (m - n) == 168:
            x = n ** 2 - 100
            print "符合条件的整数有:", x

# 第六种方法
# 根据题意可先求出所求数的最大范围，并在范围内部循环测试是否有满足条件的数字，若有，则打印出来:
i = 1
# 求出最大范围
while ((i + 1) * (i + 1) - i * i) <= 168:
    i += 1
# 循环测试并打印
for j in range(1, i):
    for k in range(1, i):
        if (k * k - j * j) == 168:
            print k * k - 268

# 第七种方法
'''
分析：
设这个整数为x
1、 x+100=n^2和x+100+168=m^2
推出 m^2-n^2=168
即   （m+n)(m-n)=168
设    m+n=i m-n=j
则    i*j=168
由    i>0 j>0   推出  i%2=0 j%2=0
由    168=2*2*2*3*7
上面两个条件推出i与j值的范围[2,4,6,12,14,28,42,84]
反推：m=(i+j)/2和n=(i-j)/2 并且 n>0 推得 i>j
则     i=[14,28,42,84]
       j=[12,6,4,2]
'''

arr1 = [14, 28, 42, 84]
arr2 = [12, 6, 4, 2]
for i in range(0, 4):
    m = (arr1[i] + arr2[i]) / 2
    n = (arr1[i] - arr2[i]) / 2
    x = n * n - 100
    print x

# 第八种方法
# X1=N*2-100的合集
x1 = map(lambda i: i ** 2 - 100, range(1, 100))

# X2=M*2-100-168的合集
x2 = map(lambda i: i ** 2 - 100 - 168, range(1, 100))

# 两个合集求并集结果
print(set(list(x1)) & set(list(x2)))
